[
  {
    "jobType": "Upwork Bidder",
    "workLocation": "Remote",
    "city": "Pakistan",
    "employmentType": "Freelance",
    "jobDescription": "Drive the growth of Scons Tech’s Upwork account by identifying, bidding, and securing projects on platforms like Upwork and Fiverr.",
    "roleDescription": "Manage and grow Scons Tech’s Upwork account by crafting compelling proposals, communicating with clients, and securing high-value projects. Earn a competitive commission for each project won.",
    "experienceLevel": "Mid-level",
    "experience": [
      "1+ year experience in freelance bidding on platforms like Upwork/Fiverr.",
      "Strong understanding of web development and design terminology.",
      "Proven track record of winning freelance projects."
    ],
    "responsibilities": [
      "Manage Scons Tech’s Upwork account, including profile optimization and bid submissions.",
      "Identify and evaluate project opportunities on Upwork and Fiverr.",
      "Craft tailored, compelling proposals to secure client projects.",
      "Communicate with clients to understand requirements and negotiate terms.",
      "Track bidding performance and report on project acquisition metrics."
    ],
    "skills": [
      "Proposal Writing",
      "Client Communication",
      "Project Scoping",
      "Negotiation",
      "Upwork Platform Expertise"
    ],
    "prioritySkills": [
      "Proposal Writing",
      "Client Communication"
    ],
    "techStack": [
      "SEO",
      "Digital Marketing"
     
    ],
    "compensationType": "Commission-based",
    "compensationDetails": "Earn a competitive commission for each project secured, with potential for high earnings based on project value and volume.",
    "benefits": [
      "Flexible working hours",
      "Remote work",
      "Opportunity to grow with a dynamic tech company"
    ],
 
    "postedOn": "2025-06-16",
    "closedOn": null,
    "isOpen": true
  },
  {
    "jobType": "Illustration Designer",
    "workLocation": "Remote",
    "city": "Pakistan",
    "employmentType": "Freelance",
    "jobDescription": "Create custom illustrations and digital artwork based on client briefs to enhance Scons Tech’s creative projects.",
    "roleDescription": "Collaborate with clients and the Scons Tech creative team to deliver high-quality, visually stunning illustration assets for various projects.",
    "experienceLevel": "Mid-level",
    "experience": [
      "2+ years of experience in digital illustration.",
      "Portfolio showcasing a variety of styles and projects.",
      "Comfortable using tools like Adobe Illustrator, Photoshop, or Procreate."
    ],
    "responsibilities": [
      "Create custom illustrations based on client briefs and project requirements.",
      "Collaborate with the creative team to ensure artwork aligns with brand guidelines.",
      "Revise designs based on client and team feedback.",
      "Deliver high-quality digital assets in a timely manner."
    ],
    "skills": [
      "Digital Illustration",
      "Adobe Illustrator",
      "Creative Concepting",
      "Adobe Photoshop",
      "Procreate"
    ],
    "prioritySkills": [
      "Digital Illustration",
      "Adobe Illustrator"
    ],
    "techStack": [
      "Illustrator",
      "Adobe XD",
      "Canva"
    ],
    "compensationType": "Project-based",
    "compensationDetails": "Competitive rates per project, with potential for recurring work based on client satisfaction.",
    "benefits": [
      "Flexible working hours",
      "Remote work",
      "Showcase your work in Scons Tech’s portfolio"
    ],

    "postedOn": "2025-06-15",
    "closedOn": null,
    "isOpen": true
  }
]