[
    {
  "id": 1,
  "heading": "SN Hydraulik Service",
  "headline": "Website for Hydraulic Repair & Maintenance Services",
  "location": "Welzheim, Germany",
  "bodyText": "Crafted a professional WordPress website for a German hydraulic service company, enhancing their digital presence and service outreach.",
  "details": "SN Hydraulik Service required a reliable and visually appealing website to highlight their expertise in hydraulic repair and maintenance. We utilized WordPress with Elementor for rapid development, and incorporated brand-aligned graphics designed in Canva and Adobe Photoshop to ensure a consistent, high-impact visual identity.",
  "service": ["Web Development", "UI/UX Design", "Branding"],
  "technologies": ["WordPress", "Elementor", "Canva", "Photoshop", "SEO", "Digital Marketing", "Branding"],
  "year": "2023",
  "clientDetails": "A trusted hydraulic service provider based in Welzheim, Germany, offering specialized repair, maintenance, and system optimization solutions for a wide range of industrial clients. The company is committed to precision engineering, quick response times, and customer-centric service delivery across the region.",
"deliverables": [
  "WordPress Website",
  "Responsive (Elementor)",
  "Visuals (Canva, PS)",
  "Service Pages & Contact",
  "SEO Content"
],

  "impactIntro": "The redesigned website boosted brand professionalism and improved customer outreach.",
  "impacts": [
    {
      "heading": "Stronger Online Presence",
      "text": "Modernized design and responsive layout led to a 35% increase in web traffic."
    },
    {
      "heading": "Better Customer Engagement",
      "text": "Streamlined contact pathways encouraged more service inquiries from local clients."
    },
    {
      "heading": "Brand Cohesion",
      "text": "Consistent visuals improved brand recognition across digital channels."
    }
  ]
},

   {
  "id": 2,
  "heading": "Dr. Thomas Tresper",
  "headline": "Bilingual Website for German IP Attorney",
  "location": "Frankfurt am Main, Germany",
  "bodyText": "Developed a bilingual website for a German attorney specializing in intellectual property law, ensuring accessibility for both German and international clients.",
  "details": "Dr. Thomas Tresper, a seasoned German attorney at law (Rechtsanwalt) with a specialization in IP and unfair competition, needed a professional online presence to represent his legal services. We designed a clean and trustworthy layout in Figma, and developed the website using WordPress and Elementor. The site supports both German and English content, allowing seamless communication with a broader clientele.",
  "service": ["Web Development", "UI/UX Design"],
  "technologies": ["WordPress", "Elementor", "Figma"],
  "year": "2023",
  "clientDetails": "Dr. Thomas Tresper is a Frankfurt-based Rechtsanwalt practicing since 2005, with a sharp focus on intellectual property rights and unfair competition law. His clientele includes both domestic and international businesses seeking expert legal representation in protecting and enforcing their IP assets.",
"deliverables": [
  "Bilingual Website (DE/EN)",
  "UI Design (Figma)",
  "Responsive (Elementor)",
  "Contact & Legal Pages"
],

  "impactIntro": "The bilingual site enhanced professional outreach and accessibility for international clients.",
  "impacts": [
    {
      "heading": "Broadened Client Reach",
      "text": "Dual-language support enabled effective communication with German and English-speaking clients alike."
    },
    {
      "heading": "Professional Online Presence",
      "text": "Elegant design and legal-focused layout reinforced credibility and trust."
    },
    {
      "heading": "Improved Usability",
      "text": "Responsive design ensured smooth user experience across all devices."
    }
  ]
},

   {
  "id": 3,
  "heading": "Landes & Kollegen",
  "headline": "Website for Oral & Maxillofacial Surgery Specialists",
  "location": "Offenbach, Germany",
  "bodyText": "Developed a modern, interactive website for a team of oral and maxillofacial surgeons affiliated with Sana Klinikum Offenbach, improving patient communication and emergency awareness.",
  "details": "Landes & Kollegen, specialists in oral and maxillofacial surgery, needed a professional digital platform to reflect their emergency readiness and surgical expertise. We built a dynamic, visually engaging WordPress site using custom animations with GSAP and interactive UI elements powered by jQuery, ensuring responsiveness and user engagement.",
  "service": ["Web Development", "Digital Marketing"],
  "technologies": ["WordPress", "JavaScript", "Digital Marketing", "SEO"],
  "year": "2023",
  "clientDetails": "Landes & Kollegen is a team of certified oral and maxillofacial surgeons operating out of Offenbach, Germany. They are affiliated with Sana Klinikum Offenbach and provide around-the-clock emergency surgical care involving the mouth, jaw, and face. Their commitment to prompt, expert care is matched by their emphasis on patient education and digital accessibility.",
"deliverables": [
  "Custom WP Website",
  "Animated UI (GSAP)",
  "Interactive (jQuery)",
  "Emergency Info & Contact"
],
  "impactIntro": "The new website strengthened digital communication and reflected the clinic’s readiness for emergency care.",
  "impacts": [
    {
      "heading": "Improved Emergency Access",
      "text": "Clear call-to-action and emergency contact options improved patient response time."
    },
    {
      "heading": "Engaging User Experience",
      "text": "GSAP-powered animations enhanced visual appeal and user engagement."
    },
    {
      "heading": "Enhanced Digital Reputation",
      "text": "Modern interface reinforced the clinic’s expertise and reliability in surgical care."
    }
  ]
},


   {
  "id": 5,
  "heading": "Visa Hub International",
  "headline": "Visa Consultation Website for Global Non-Immigrant Services",
  "location": "Dubai, UAE",
  "bodyText": "Developed a comprehensive web portal for a visa consultancy firm, streamlining client onboarding and showcasing their global visa services through a modern digital platform.",
  "details": "Visa Hub International needed a professional, scalable website to support their expanding non-immigrant visa services. We developed the site in WordPress using Elementor for rapid design deployment and customized integrations. Additionally, we integrated Magento components and SQL-based tools for managing application data and service workflows efficiently.",
  "service": ["Web Development", "UI/UX Design", "Digital Marketing"],
  "technologies": ["WordPress", "Elementor", "Canva", "SEO", "Oracle"],
  "year": "2023",
  "clientDetails": "Visa Hub International is a trusted global consultancy dedicated to simplifying non-immigrant visa applications for individuals and families. With experienced consultants and a user-centric approach, Visa Hub offers tailored guidance across multiple visa categories including tourism, business, and study abroad programs.",
"deliverables": [
  "WP Website (Elementor)",
  "SQL Integration",
  "Magento Modules",
  "Multi-page Forms & Automation"
],
  "impactIntro": "The new platform significantly enhanced operational efficiency and broadened Visa Hub’s digital reach.",
  "impacts": [
    {
      "heading": "Streamlined Visa Applications",
      "text": "Optimized digital forms and SQL workflows improved client onboarding by 35%."
    },
    {
      "heading": "Expanded Global Reach",
      "text": "The SEO-ready, responsive site attracted clients from over 15 new countries within the first quarter."
    },
    {
      "heading": "Professional Brand Identity",
      "text": "Modern layout and service clarity improved credibility and conversion rates."
    }
  ]
},



   {
  "id": 7,
  "heading": "Elegant Esthetics",
  "headline": "Luxury Beauty & Wellness Website for an Aesthetic Studio",
  "location": "California, USA",
  "bodyText": "Designed and developed a visually elegant website for a beauty and skincare brand, enhancing their digital presence and promoting a client-first self-care philosophy.",
  "details": "Elegant Esthetics needed a refined and welcoming website to represent their luxury skincare and wellness services. We used Adobe XD to prototype a soft, calming UI/UX design, developed the site with WordPress, and utilized Elementor for custom styling and modularity. The final result reflected the brand’s dedication to personalized care and sophistication.",
  "service": ["Web Development", "UI/UX Design", "Digital Marketing"],
  "technologies": ["WordPress", "Elementor", "Adobe XD"],
  "year": "2023",
  "clientDetails": "Elegant Esthetics is a U.S.-based aesthetic studio founded by Tiffany Tovar, offering personalized skincare, beauty, and wellness services. With a mission to empower self-care, the studio blends expert knowledge with elegant service delivery to help clients look and feel radiant.",
"deliverables": [
  "WP Website (Elementor)",
  "Design Prototypes (Adobe XD)",
  "Responsive Mobile Layout",
  "Contact & Booking Modules"
],
  "impactIntro": "The new website created a luxurious and approachable digital identity for the client, increasing online bookings and engagement.",
  "impacts": [
    {
      "heading": "Elevated Brand Image",
      "text": "A modern, feminine design elevated client trust and reinforced brand elegance."
    },
    {
      "heading": "Improved Online Bookings",
      "text": "Clear navigation and call-to-action sections increased appointment inquiries by 45%."
    },
    {
      "heading": "User-Friendly Experience",
      "text": "Mobile-optimized and intuitive design enhanced client interaction across devices."
    }
  ]
},
 

    {
        "id": 8,
        "heading": "Matuszak Hygiene",
        "headline": "Pest Management Website for Industrial Hygiene",
        "location": "Sprendlingen, Germany",
        "bodyText": "Developed a tailored CMS website for a German pest control company, streamlining content management and enhancing user experience.",
        "details": "Matuszak Hygiene required a professional and responsive website to showcase their pest management services for industrial and production environments. We designed a user-friendly interface using Figma, developed the site in WordPress, and utilized Elementor for rapid deployment and design customization.",
  "service": ["Web Development", "UI/UX Design", "Digital Marketing", "Branding"],
        "technologies": ["WordPress", "Figma", "Elementor", "SEO"],
        "year": "2023",
      "clientDetails": "A German hygiene-focused company headquartered in Sprendlingen, specializing in advanced pest control solutions tailored for industrial and commercial sectors. With a strong foundation in the local market, the company is actively working to expand its presence across the European Union and into international markets, aiming to deliver high-quality, compliant, and sustainable hygiene services at scale.",

    "deliverables": [
  "Custom WP Website",
  "Design Prototyping (Figma)",
  "Responsive (Elementor)",
  "SEO Pages & Contact Form"
],

        "impactIntro": "The newly developed website significantly improved customer engagement and online presence.",
        "impacts": [
          {
            "heading": "Enhanced Visibility",
            "text": "Increased online traffic by 40% through a modern, mobile-optimized interface."
          },
          {
            "heading": "Streamlined Communication",
            "text": "Integrated contact forms and service listings led to more direct client inquiries."
          },
          {
            "heading": "Improved Brand Image",
            "text": "Professional design elevated trust and credibility among industrial clients."
          }
        ]
      },

      {
  "id": 9,
  "heading": "Global Nation",
  "headline": "Creator-Focused Platform Empowering Global Artistic Connections",
  "location": "California, USA",
  "bodyText": "Built a dynamic and scalable platform for a U.S.-based creator community, evolving from Wix to WordPress and ultimately to a modern React-based web application to support global collaboration and monetization.",
  "details": "Global Nation™ is the successor to PatroNet, an early-2000s creator-support platform founded by Todd Rundgren. The new platform aimed to empower creators worldwide by offering a space to connect, collaborate, and monetize their work. The project involved multiple phases: initial deployment on Wix, migration to WordPress for enhanced control, and final transition to a robust, React-based architecture to support scalability and custom features. Wise payment integration was implemented for seamless international transactions.",
  "service": ["Web Development", "Platform Migration", "UI/UX Design", "Payment Integration"],
  "technologies": ["Wix", "WordPress", "React", "Wise API", "JavaScript", "Figma"],
  "year": "2023",
  "clientDetails": "Global Nation™, based in California, is a visionary platform reimagining the creator economy. It provides artists, musicians, and creative professionals a dedicated space to showcase their work, connect with supporters, and monetize directly via peer-driven engagement. With a focus on decentralization, community building, and sustainability, the platform is attracting a diverse global user base.",
  "deliverables": [
    "Initial Wix Setup",
    "WordPress Migration",
    "Full React Rebuild",
    "Wise Payment Integration",
    "Custom UI Components",
    "Mobile-Responsive Design"
  ],
  "impactIntro": "The multi-stage transformation of the Global Nation™ platform empowered creators with enhanced tools, international reach, and a stronger sense of community.",
  "impacts": [
    {
      "heading": "Creator Empowerment",
      "text": "Provided artists a direct-to-fan revenue model, increasing patron contributions by 60%."
    },
    {
      "heading": "Platform Scalability",
      "text": "React-based architecture allowed for seamless expansion of features and user load handling."
    },
    {
      "heading": "International Payments",
      "text": "Wise integration facilitated smooth, low-fee global transactions for creators and supporters alike."
    }
  ]
},

{
  "id": 10,
  "heading": "Zeitly",
  "headline": "Precision Appointment Scheduling Built for Modern Teams and Freelancers",
  "location": "Hamburg, Germany",
  "bodyText": "Zeitly is a modern, sleek SaaS product crafted by Scons Tech to streamline appointment scheduling for teams, freelancers, and service-based businesses. It emphasizes time efficiency, intuitive design, and global usability, with a powerful backend and elegant UI built on cutting-edge technologies.",
  "details": "Zeitly was envisioned as a response to outdated, bloated scheduling tools that failed to meet the expectations of fast-moving, digitally native professionals. The platform enables users to create customizable booking links, sync calendars, automate reminders, and accept international payments — all within a minimalist and mobile-friendly interface. Inspired by German precision and powered by a React-based architecture, Zeitly is designed for scalability, seamless performance, and brand integration. It’s ideal for consultants, agencies, clinics, and solo professionals looking to automate their bookings while delivering a smooth experience to clients.",
  "service": ["SaaS Product Development", "UI/UX Design", "Calendar & Email Integration", "Payment Integration"],
  "technologies": ["React", "Tailwind CSS", "Node.js", "MongoDB", "Google Calendar API", "Wise API", "Figma"],
  "year": "2024",
  "clientDetails": "Zeitly is a flagship SaaS product developed in-house by Scons Tech, a Hamburg-based software consultancy. It’s positioned as a lean, modern alternative to legacy scheduling platforms, tailored for freelancers, startups, and professional service providers who prioritize efficiency, reliability, and great UX. Zeitly combines strong engineering with European design sensibility to make time management effortless.",
  "deliverables": [
    "Product Naming & Branding",
    "Custom Dashboard Design",
    "Responsive Booking UI",
    "Google Calendar Integration",
    "Email & SMS Reminder System",
    "International Payment Support (via Wise)"
  ],
  "impactIntro": "Zeitly has quickly gained traction among productivity-focused professionals for its ease of use, fast interface, and seamless booking flow.",
  "impacts": [
    {
      "heading": "Increased Conversion Rates",
      "text": "Early users reported a 40% increase in booking completions thanks to the simplified, no-login flow."
    },
    {
      "heading": "Efficient Time Management",
      "text": "Automated reminders and calendar sync reduced missed appointments by 70% among beta users."
    },
    {
      "heading": "International Reach",
      "text": "Built-in Wise payments enabled global freelancers to accept bookings from clients in 20+ countries with minimal fees."
    }
  ]
}



      
    
  ]